---
kind: property
id: P:Autodesk.Revit.DB.NumericRevisionSettings.Suffix
source: html/4787939b-9e9c-a722-1c4a-b6cefd63d5d1.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings.Suffix Property

The suffix string that will be appended to the number of each revision with Numeric RevisionNumberingType.

## Syntax (C#)
```csharp
public string Suffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null